// Набір правил, що визначає порядок та особливості передачі інформації протокол передачі даних
// Перш ніж загрузити сторінку маємо отримати дані з серверу
// HTTP - HyperText Transfer Protocol використовується для передачі довільних даних в інтернеті як текст
// побудований на моделі клієнт-сервер(структура)та запит-відповідь
// 1) DNS-запит шукає найближчий DNS-сервер для перетворення імені домену (наприклад, google.com)
// у його числове представлення, IP-адресу (74.125.87.99).
// 2) З'єднання - це встановлення з'єднання з сервером за допомогою отриманої IP-адреси.
// 3) Надсилання даних — це надсилання пакетів від клієнта до сервера.
// 4) Очікування відповіді — це очікування, поки пакети даних досягнуть сервера, після чого він їх обробить і поверне відповідь.
// 5) Отримання даних означає, що пакети тут, і ви можете отримати дані з них.
// може бути декілька клієнтів/серверів
// Якщо сервер не працює - жодному з клієнтів не буде приходити відповідь
// Загловки - для передачі службової інформації
// MIME-типи - Рядки, які визначають тип даних, що передаються
